Revit 2027 API
RebarConstraint.GetRebarConstraintTargetHostFaceType(Int32) Method
 Returns the RebarConstraintTargetHostFaceType of the host Element face to which the RebarConstraint is attached. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace' or 'ToCover'.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarConstraintTargetHostFaceType GetRebarConstraintTargetHostFaceType(
	int targetIndex
)
Public Function GetRebarConstraintTargetHostFaceType (
	targetIndex As Integer
) As RebarConstraintTargetHostFaceType
public:
RebarConstraintTargetHostFaceType GetRebarConstraintTargetHostFaceType(
	int targetIndex
)
member GetRebarConstraintTargetHostFaceType :
        targetIndex : int -> RebarConstraintTargetHostFaceType
Parameters
targetIndex Int32
 The index of the target. Should be between 0 and NumberOfTargets().
Return Value
RebarConstraintTargetHostFaceType
 Returns the RebarConstraintTargetHostFaceType of the host Element face to which the RebarConstraint is attached.
Exceptions
Exception | Condition
ArgumentException |  targetIndex is out of range.
InvalidOperationException |  RebarConstraint is no longer valid. -or- The RebarConstraint is not of RebarConstraintType 'FixedDistanceToHostFace' or 'ToCover'.
See Also
Reference
RebarConstraint Class
GetRebarConstraintTargetHostFaceType Overload
Autodesk.Revit.DB.Structure Namespace